src/main/resources/xml/trainingServer/createActor.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:my="my-namespace">
   <soapenv:Header/>
   <soapenv:Body>
      <my:createActorRequest>
         <my:firstName></my:firstName>
         <my:lastName></my:lastName>
      </my:createActorRequest>
   </soapenv:Body>
</soapenv:Envelope>
